<?php

namespace Database\Seeders;

use App\Models\Service;
use App\Models\ServiceCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $service_data = [
            [
                'service_type_id' => 1,
                'services_categories' => [
                    [
                        "name" => "Аллергологические услуги",
                        "services" => [
                            "Аллергопробы"
                        ]
                    ],
                    [
                        "name" => "Андрологические услуги",
                        "services" => [
                            "Вазэктомия (вазорезекция)",
                            "Вправление парафимоза",
                            "Лазерная энуклеация аденомы простаты",
                            "МАР тест",
                            "Массаж простаты",
                            "Обрезание крайней плоти",
                            "Пластика уздечки крайней плоти",
                            "Протезирование яичка",
                            "Спермограмма",
                            "ТУР аденомы простаты",
                            "Увеличение полового члена",
                            "Увеличение полового члена гиалуроновой кислотой",
                            "Удаление простаты",
                            "Удаление яичка",
                            "Фаллопротезирование"
                        ]
                    ],
                    [
                        "name" => "ЭКО",
                        "services" => [
                            "ИКСИ",
                            "ИКСИ+ПИКСИ",
                            "Криоконсервация спермы",
                            "Криоконсервация эмбрионов",
                            "Криоконсервация яйцеклеток",
                            "Лазерный хетчинг",
                            "Подсадка эмбриона",
                            "Стимуляция овуляции",
                            "ЭКО стандарт"
                        ]
                    ],
                    [
                        "name" => "Эндопротезирование",
                        "services" => [
                            "Эндопротезирование коленного сустава",
                            "Эндопротезирование тазобедренного сустава"
                        ]
                    ],
                    [
                        "name" => "Физиотерапия",
                        "services" => [
                            "Биорезонансная терапия",
                            "ВЛОК",
                            "Дарсонвализация",
                            "КВЧ-терапия",
                            "Кинезиотейпирование",
                            "Магнитотерапия",
                            "УФОК",
                            "электросон",
                            "Электрофорез"
                        ]
                    ],
                    [
                        "name" => "Флебология",
                        "services" => [
                            "Лазерное лечение варикоза"
                        ]
                    ],
                    [
                        "name" => "Гинекологические услуги",
                        "services" => [
                            "Ведение беременности",
                            "Видеокольпоскопия",
                            "Вскрытие абсцесса бартолиновой железы",
                            "Выскабливание матки",
                            "Гименопластика",
                            "Гинекологический массаж",
                            "Гистероскопия",
                            "Инсеминация",
                            "Интимная пластика",
                            "Кольпоскопия",
                            "Лапароскопия диагностическая в гинекологии",
                            "Мазок на флору",
                            "Офисная гистероскопия",
                            "Пайпель-биопсия эндометрия",
                            "Удаление кисты бартолиновой железы",
                            "Удаление матки",
                            "Удаление маточных труб",
                            "Удаление полипа матки",
                            "Удаление полипа шейки матки",
                            "Хирургическая дефлорация"
                        ]
                    ],
                    [
                        "name" => "Внутриматочная спираль (ВМС)",
                        "services" => [
                            "Удаление спирали (ВМС)"
                        ]
                    ],
                    [
                        "name" => "Контрацепция",
                        "services" => [
                            "Перевязка маточных труб",
                            "Противозачаточный имплант"
                        ]
                    ],
                    [
                        "name" => "Лечение матки",
                        "services" => [
                            "Лапароскопия миомы матки",
                            "Удаление миомы матки",
                            "Эмболизация миомы матки"
                        ]
                    ],
                    [
                        "name" => "Лечение шейки матки",
                        "services" => [
                            "Биопсия шейки матки",
                            "Конизация шейки матки",
                            "Прижигание шейки матки"
                        ]
                    ],
                    [
                        "name" => "Лечение яичника",
                        "services" => [
                            "Лапароскопия кисты яичника",
                            "Пункция кисты яичника",
                            "Удаление кисты яичника",
                            "Вакуумный аборт (мини-аборт)",
                            "Медикаментозный аборт",
                            "Хирургический аборт"
                        ]
                    ],
                    [
                        "name" => "Проходимость маточных труб",
                        "services" => [
                            "Гистеросальпингография (ГСГ)",
                            "Лапароскопия маточных труб",
                            "Продувание маточных труб",
                            "УЗИ проходимости маточных труб"
                        ]
                    ],
                    [
                        "name" => "Хирургические услуги",
                        "services" => [
                            "Вскрытие абсцесса",
                            "Криодеструкция базалиомы",
                            "Перевязка раны",
                            "Снятие швов после операции",
                            "Удаление атеромы",
                            "Удаление базалиомы",
                            "Удаление базалиомы лазером",
                            "Удаление гигромы",
                            "Удаление гигромы лазером",
                            "Удаление липомы",
                            "Удаление липомы лазером",
                            "Удаление полипа желудка",
                            "Удаление фурункула",
                            "Хирургическая обработка раны"
                        ]
                    ],
                    [
                        "name" => "Бариатрическая хирургия",
                        "services" => [
                            "Удаление внутрижелудочного баллона",
                            "Установка внутрижелудочного баллона",
                            "Шунтирование желудка"
                        ]
                    ],
                    [
                        "name" => "Косметологические услуги",
                        "services" => [
                            "Гоммаж для лица",
                            "Массаж лица",
                            "Медицинский педикюр",
                            "Парафинотерапия лица и рук",
                            "Чистка лица атравматичная",
                            "Чистка лица механическая"
                        ]
                    ],
                    [
                        "name" => "Аппаратная косметология",
                        "services" => [
                            "RF-лифтинг",
                            "Ионофорез",
                            "Карбокситерапия",
                            "Криотерапия лица",
                            "Микротоковая терапия",
                            "Плазмаферез",
                            "прессотерапия",
                            "Ультразвуковая чистка",
                            "Фонофорез",
                            "Фотоомоложение",
                            "Эндосфера-терапия"
                        ]
                    ],
                    [
                        "name" => "Инъекционная косметология",
                        "services" => [
                            "Биоревитализация",
                            "Инъекция ботокса",
                            "Инъекция диспорта",
                            "Инъекция ксеомина",
                            "Контурная пластика",
                            "Липофилинг губ",
                            "Липофилинг лица",
                            "Мезотерапия лица",
                            "Мезотерапия тела",
                            "Озонотерапия лица",
                            "Озонотерапия тела",
                            "Плазмолифтинг лица",
                            "Увеличение губ"
                        ]
                    ],
                    [
                        "name" => "Лазерная хирургия",
                        "services" => [
                            "Лазерная шлифовка лица",
                            "Лазерная шлифовка рубцов",
                            "Лазерное омоложение",
                            "Лазерное удаление растяжек",
                            "Удаление бородавок",
                            "Удаление вросшего ногтя",
                            "Удаление гемангиомы",
                            "Удаление кондилом",
                            "Удаление папиллом",
                            "Удаление родинок",
                            "Удаление сосудистых звездочек"
                        ]
                    ],
                    [
                        "name" => "Пилинг",
                        "services" => [
                            "TCA-пилинг",
                            "Газожидкостный пилинг",
                            "Гликолевый пилинг",
                            "Коралловый пилинг",
                            "Миндальный пилинг",
                            "Молочный пилинг",
                            "Пилинг PRX-T33",
                            "Пилинг Джесснера",
                            "Ретиноевый пилинг",
                            "Салициловый пилинг",
                            "Энзимный пилинг"
                        ]
                    ],
                    [
                        "name" => "Эпиляция",
                        "services" => [
                            "Лазерная эпиляция",
                            "Фотоэпиляция",
                            "Электроэпиляция"
                        ]
                    ],
                    [
                        "name" => "Лечение глаз",
                        "services" => [
                            "Исправление косоглазия",
                            "Комплексная диагностика зрения",
                            "Коррекция зрения Супер Ласик",
                            "Коррекция зрения Фемто Ласик",
                            "Лазерная коагуляция сетчатки",
                            "Операция при глаукоме",
                            "Операция при катаракте",
                            "Склеропластика"
                        ]
                    ],
                    [
                        "name" => "Массаж",
                        "services" => [
                            "LPG массаж",
                            "Антицеллюлитный массаж",
                            "Баночный массаж",
                            "Вакуумный массаж",
                            "Висцеральный массаж живота",
                            "Детский массаж",
                            "Криомассаж",
                            "Лимфодренажный массаж",
                            "Массаж головы",
                            "Массаж Гуаша",
                            "Массаж для похудения",
                            "Массаж спины",
                            "Массаж шейно-воротниковой зоны",
                            "Общий массаж",
                            "Спортивный массаж",
                            "Точечный массаж"
                        ]
                    ],
                    [
                        "name" => "Наркологические услуги",
                        "services" => [
                            "Вывод из запоя",
                            "Кодирование от алкоголизма"
                        ]
                    ],
                    [
                        "name" => "ЛОР услуги",
                        "services" => [
                            "Отоскопия",
                            "Пункция гайморовой пазухи",
                            "Промывание носа (\"кукушка\")",
                            "Промывание ушей",
                            "Тимпанометрия",
                            "Удаление серной пробки"
                        ]
                    ],
                    [
                        "name" => "Аудиометрия",
                        "services" => [
                            "Игровая аудиометрия",
                            "Объективная аудиометрия",
                            "Пороговая аудиометрия",
                            "Речевая аудиометрия",
                            "Скрининговая аудиометрия",
                            "Тональная аудиометрия"
                        ]
                    ],
                    [
                        "name" => "Тонзиллэктомия",
                        "services" => [
                            "Удаление миндалин лазером",
                            "Удаление миндалин методом коблации",
                            "Удаление миндалин хирургическое"
                        ]
                    ],
                    [
                        "name" => "Оздоровительные услуги",
                        "services" => [
                            "PRP терапия",
                            "гипнотерапия",
                            "Гирудотерапия",
                            "Иглоукалывание",
                            "ударно-волновая терапия"
                        ]
                    ],
                    [
                        "name" => "Пластические операции",
                        "services" => [
                            "Абдоминопластика",
                            "Блефаропластика (верхняя)",
                            "Блефаропластика",
                            "Блефаропластика (нижняя)",
                            "Брахиопластика",
                            "Глютеопластика",
                            "Круропластика",
                            "Лабиопластика",
                            "Лечение гинекомастии",
                            "Липосакция",
                            "Маммопластика",
                            "Отопластика",
                            "Подтяжка груди",
                            "Подтяжка лица",
                            "Ринопластика",
                            "Септопластика",
                            "Уменьшение груди"
                        ]
                    ],
                    [
                        "name" => "Прививки",
                        "services" => [
                            "Диаскинтест",
                            "Прививка АКДС",
                            "Прививка от бешенства",
                            "Прививка от ветряной оспы",
                            "Прививка от гепатита А",
                            "Прививка от гепатита В",
                            "Прививка от гриппа",
                            "Прививка от клещевого энцефалита",
                            "Прививка от кори",
                            "Прививка от полиомиелита",
                            "Прививка от столбняка",
                            "Прививка Превенар",
                            "Прививка Приорикс",
                            "ПЦР тест на коронавирус"
                        ]
                    ],
                    [
                        "name" => "Проктологические услуги",
                        "services" => [
                            "Гидроколонотерапия",
                            "Дезартеризация геморроя",
                            "Иссечение анальной трещины",
                            "Лазерная коагуляция геморроя",
                            "Лигирование геморроя латексными кольцами",
                            "Постановка очистительной клизмы",
                            "Постановка сифонной клизмы",
                            "Радиоволновое удаление свища прямой кишки",
                            "Склеротерапия геморроидальных узлов",
                            "Удаление геморроя (геморроидэктомия)",
                            "Удаление геморроя лазером",
                            "Удаление копчиковой кисты",
                            "Удаление ободочной кишки",
                            "Удаление полипа прямой кишки",
                            "Удаление полипа толстой кишки",
                            "Удаление прямой кишки",
                            "Удаление свища прямой кишки",
                            "Удаление свища прямой кишки лазером",
                            "Удаление сигмовидной кишки"
                        ]
                    ],
                    [
                        "name" => "Медицинские справки",
                        "services" => [
                            "Медкнижка",
                            "Справка 086-У",
                            "Справка в бассейн",
                            "Справка водительская",
                            "Справка для ГИМС",
                            "Справка на оружие"
                        ]
                    ],
                    [
                        "name" => "Лечение зубов",
                        "services" => [
                            "Лечение зубов под наркозом",
                            "Лечение каналов",
                            "Лечение кариеса",
                            "Лечение кариеса ICON",
                            "Лечение кариеса лазером",
                            "Наращивание зубов",
                            "Реставрация зубов"
                        ]
                    ],
                    [
                        "name" => "Пародонтология",
                        "services" => [
                            "Лечение гингивита",
                            "Лечение пародонтита",
                            "Лечение пародонтоза",
                            "Лечение периодонтита",
                            "Лечение периостита",
                            "Лечение пульпита"
                        ]
                    ],
                    [
                        "name" => "Украшения на зубы",
                        "services" => [
                            "Скайсы на зубы",
                            "Стразы на зубах"
                        ]
                    ],
                    [
                        "name" => "Чистка зубов",
                        "services" => [
                            "Герметизация фиссур у взрослых",
                            "Гигиеническая чистка зубов",
                            "Покрытие зуба защитным лаком",
                            "Покрытие зубов фторлаком",
                            "Снятие зубных отложений",
                            "Удаление зубного камня",
                            "Фторирование зубов",
                            "Чистка зубов Air Flow",
                            "Чистка зубов ультразвуком"
                        ]
                    ],
                    [
                        "name" => "Отбеливание зубов",
                        "services" => [
                            "Лазерное отбеливание зубов",
                            "Отбеливание зубов Opalescence",
                            "Отбеливание зубов ZOOM",
                            "Фотоотбеливание зубов"
                        ]
                    ],
                    [
                        "name" => "Хирургическая стоматология",
                        "services" => [
                            "Иссечение капюшона зуба мудрости",
                            "Пластика уздечки языка",
                            "Сложное удаление зуба",
                            "Удаление зуба",
                            "Удаление зуба мудрости",
                            "Удаление зуба ультразвуком",
                            "Удаление зубов под наркозом",
                            "Удаление кисты зуба"
                        ]
                    ],
                    [
                        "name" => "Имплантация зубов",
                        "services" => [
                            "Базальная имплантация зубов",
                            "Бюгельный протез",
                            "Имплантация зубов «под ключ»",
                            "Импланты AB Dental",
                            "Импланты All-on-4",
                            "Импланты All-on-6",
                            "Импланты Alpha Bio",
                            "Импланты Ankylos",
                            "Импланты Anthogyr",
                            "Импланты Astra Tech",
                            "Импланты Дентиум",
                            "Импланты Inno",
                            "Импланты MIS 7 Seven",
                            "Импланты MIS C1",
                            "Импланты NeoBiotech",
                            "Импланты Neodent",
                            "Импланты Nico",
                            "Импланты Nobel Biocare",
                            "Импланты Osstem",
                            "Импланты SGS",
                            "Импланты Straumann",
                            "Импланты SuperLine",
                            "Импланты XIVE",
                            "Импланты Имплантиум",
                            "Мини-импланты",
                            "Протезирование на имплантах",
                            "Синус-лифтинг",
                            "Экспресс имплантация зубов"
                        ]
                    ],
                    [
                        "name" => "Коронки",
                        "services" => [
                            "Безметалловая керамика",
                            "Временные коронки",
                            "Золотые коронки",
                            "Зубной мост",
                            "Керамические коронки",
                            "Коронка из диоксида циркония",
                            "Культевая вкладка",
                            "Металлокерамические коронки",
                            "Пластмассовые коронки",
                            "Фарфоровые коронки"
                        ]
                    ],
                    [
                        "name" => "Виниры",
                        "services" => [
                            "Керамические виниры",
                            "Композитные виниры",
                            "Люминиры"
                        ]
                    ],
                    [
                        "name" => "Брекеты",
                        "services" => [
                            "Брекеты Damon",
                            "Брекеты Инкогнито",
                            "Керамические брекеты",
                            "Лингвальные брекеты",
                            "Металлические брекеты",
                            "Пластиковые брекеты",
                            "Прозрачные брекеты",
                            "Самолигирующие брекеты",
                            "Сапфировые брекеты",
                            "Элайнеры"
                        ]
                    ],
                    [
                        "name" => "Детская стоматология",
                        "services" => [
                            "Герметизация фиссур у детей",
                            "Исправление прикуса у детей",
                            "Лечение молочных зубов",
                            "Пломбирование молочных зубов",
                            "Реставрация молочных зубов",
                            "Серебрение молочных зубов",
                            "Удаление молочного зуба"
                        ]
                    ],
                    [
                        "name" => "Рентген зубов",
                        "services" => [
                            "КТ зубных рядов",
                            "Снимок зуба",
                            "Панорамный снимок зубов"
                        ]
                    ],
                    [
                        "name" => "Исправление прикуса",
                        "services" => [
                            "Капы для выравнивания зубов",
                            "Пластинки для выравнивания зубов",
                            "Ретейнеры",
                            "Трейнеры для зубов"
                        ]
                    ],
                    [
                        "name" => "Укол",
                        "services" => [
                            "Внутривенная инъекция",
                            "Внутримышечная инъекция",
                            "Капельница"
                        ]
                    ],
                    [
                        "name" => "Прием специалиста",
                        "services" => [
                            "Консультация врача-педиатра",
                            "Консультация врача гастроэнтеролога-нутрициолога",
                            "Консультация врача эндокринолога-нутрициолога",
                            "врач-колопроктолог",
                            "врач-гастроэнтеролог",
                            "врач-диетолог",
                            "врач-оториноларинголог",
                            "врач-эндокринолог",
                            "врач-эндоскопист",
                            "врач-терапевт"
                        ]
                    ]
                ]
            ],
            [
                'service_type_id' => 2,
                'services_categories' => [
                    [
                        "name" => "Эндоскопия",
                        "services" => [
                            "Артроскопия",
                            "Бронхоскопия",
                            "Гастроскопия под наркозом",
                            "Гастроскопия (ФГДС)",
                            "Капсульная эндоскопия",
                            "Колоноскопия",
                            "Колоноскопия (ФКС) под наркозом",
                            "Ректороманоскопия",
                            "Цистоскопия"
                        ]
                    ],
                    [
                        "name" => "ФД сердца",
                        "services" => [
                            "велоэргометрия (тредмил-тест)",
                            "Суточное мониторирование АД и ЭКГ",
                            "ЭКГ (кардиограмма)",
                            "ЭКГ по Холтеру"
                        ]
                    ],
                    [
                        "name" => "ФД мозга",
                        "services" => [
                            "Реоэнцефалография (РЭГ)",
                            "Эхоэнцефалография (Эхо-ЭГ)",
                            "ЭЭГ",
                            "ЭЭГ сна",
                            "Биоимпедансометрия",
                            "Денситометрия",
                            "Спирометрия",
                            "Эластометрия печени",
                            "Электромиография (ЭМГ)"
                        ]
                    ],
                    [
                        "name" => "КТ головы",
                        "services" => [
                            "внутреннего уха",
                            "головного мозга",
                            "лицевого скелета",
                            "орбит",
                            "придаточных пазух носа",
                            "турецкого седла"
                        ]
                    ],
                    [
                        "name" => "КТ шеи",
                        "services" => [
                            "гортани, глотки, трахеи",
                            "мягких тканей шеи",
                            "щитовидной и паращитовидных желез"
                        ]
                    ],
                    [
                        "name" => "КТ грудной клетки",
                        "services" => [
                            "легких",
                            "пищевода",
                            "средостения"
                        ]
                    ],
                    [
                        "name" => "КТ брюшной полости и малого таза",
                        "services" => [
                            "забрюшинного пространства",
                            "малого таза",
                            "мочевыводящих путей",
                            "надпочечников",
                            "печени и желчевыводящих путей",
                            "поджелудочной железы",
                            "почек",
                            "селезенки"
                        ]
                    ],
                    [
                        "name" => "Виртуальная эндоскопия",
                        "services" => [
                            "МР-бронхоскопия",
                            "МР-колоноскопия"
                        ]
                    ],
                    [
                        "name" => "КТ позвоночника",
                        "services" => [
                            "копчика"
                        ]
                    ],
                    [
                        "name" => "КТ суставов",
                        "services" => [
                            "височно-нижнечелюстных суставов",
                            "голеностопного сустава",
                            "коленного сустава",
                            "локтевого сустава",
                            "лучезапястного сустава",
                            "плечевого сустава",
                            "тазобедренного сустава"
                        ]
                    ],
                    [
                        "name" => "КТ сосудов",
                        "services" => [
                            "сосудов сердца",
                            "сосудов аорты",
                            "сосудов верхней конечности",
                            "головного мозга",
                            "сосудов нижней конечности",
                            "сосудов шеи"
                        ]
                    ],
                    [
                        "name" => "КТ мягких тканей",
                        "services" => [
                            "кисть",
                            "конечность",
                            "стопы"
                        ]
                    ],
                    [
                        "name" => "МРТ головы",
                        "services" => [
                            "гипофиза",
                            "глазных орбит и зрительных нервов",
                            "головного мозга",
                            "мосто-мозжечковых углов",
                            "придаточных пазух носа"
                        ]
                    ],
                    [
                        "name" => "МРТ шеи",
                        "services" => [
                            "гортани, глотки, трахеи",
                            "щитовидной и паращитовидных желез"
                        ]
                    ],
                    [
                        "name" => "МРТ грудной клетки",
                        "services" => [
                            "легких",
                            "молочных желез",
                            "органов грудной клетки",
                            "сердца",
                            "средостения"
                        ]
                    ],
                    [
                        "name" => "МРТ брюшной полости и таза",
                        "services" => [
                            "желчевыводящих путей",
                            "мочевыводящих путей",
                            "надпочечников",
                            "органов брюшной полости",
                            "органов забрюшинного пространства",
                            "органов малого таза",
                            "печени",
                            "поджелудочной железы",
                            "почек",
                            "селезенки"
                        ]
                    ],
                    [
                        "name" => "МРТ мягких тканей",
                        "services" => [
                            "кисти",
                            "конечности",
                            "стопы"
                        ]
                    ],
                    [
                        "name" => "МРТ позвоночника",
                        "services" => [
                            "всего позвоночника",
                            "копчика"
                        ]
                    ],
                    [
                        "name" => "МРТ суставов",
                        "services" => [
                            "височно-нижнечелюстных суставов",
                            "голеностопного сустава",
                            "коленного сустава",
                            "крестцово-подвздошных сочленений",
                            "локтевого сустава",
                            "лучезапястного сустава",
                            "плечевого сустава",
                            "тазобедренного сустава"
                        ]
                    ],
                    [
                        "name" => "МРТ сосудов",
                        "services" => [
                            "аорты брюшного отдела",
                            "аорты грудного отдела",
                            "артерий головного мозга",
                            "артерий и вен головного мозга",
                            "вен головного мозга",
                            "подвздошных артерий",
                            "почечных артерий",
                            "сердца",
                            "сосудов шеи"
                        ]
                    ],
                    [
                        "name" => "Рентген головы",
                        "services" => [
                            "височной кости",
                            "глазницы",
                            "костей носа",
                            "нижней челюсти",
                            "носоглотки",
                            "пазух носа",
                            "скуловой кости",
                            "турецкого седла"
                        ]
                    ],
                    [
                        "name" => "Рентген грудной клетки",
                        "services" => [
                            "легких",
                            "пищевода (эзофагография)",
                            "сердца",
                            "флюорография"
                        ]
                    ],
                    [
                        "name" => "Рентген брюшной полости",
                        "services" => [
                            "ирригография",
                            "желудка и 12-перстной кишки"
                        ]
                    ],
                    [
                        "name" => "Рентген для женщин",
                        "services" => [
                            "дуктография",
                            "маммография"
                        ]
                    ],
                    [
                        "name" => "Рентген костей и суставов",
                        "services" => [
                            "бедра / голени",
                            "грудины",
                            "грудного отдела позвоночника",
                            "ключицы",
                            "костей таза",
                            "лопатки",
                            "пальцев ноги или руки",
                            "плеча / предплечья",
                            "поясничного отдела позвоночника",
                            "ребер",
                            "стоп на поперечное плоскостопие",
                            "стоп на продольное плоскостопие",
                            "стопы / кисти",
                            "сустава",
                            "шейного отдела позвоночника"
                        ]
                    ],
                    [
                        "name" => "УЗИ",
                        "services" => [
                            "УЗИ легких"
                        ]
                    ],
                    [
                        "name" => "УЗИ при беременности",
                        "services" => [
                            "3D УЗИ",
                            "4D УЗИ",
                            "ранних сроков",
                            "УЗИ сердца плода",
                            "скрининг 1 триместра",
                            "скрининг 2 триместра",
                            "скрининг 3 триместра",
                            "Фолликулометрия"
                        ]
                    ],
                    [
                        "name" => "УЗИ головы",
                        "services" => [
                            "глазного яблока",
                            "головного мозга у детей",
                            "орбиты глаза",
                            "слюнных желез"
                        ]
                    ],
                    [
                        "name" => "УЗИ половой системы",
                        "services" => [
                            "матки и придатков",
                            "молочных желез",
                            "мошонки",
                            "полового члена",
                            "предстательной железы"
                        ]
                    ],
                    [
                        "name" => "УЗИ шеи",
                        "services" => [
                            "паращитовидных желез",
                            "щитовидной железы"
                        ]
                    ],
                    [
                        "name" => "УЗИ брюшной полости",
                        "services" => [
                            "желудка",
                            "желчного пузыря",
                            "желчного пузыря с определением функции",
                            "надпочечников",
                            "обзорное всех органов",
                            "печени",
                            "поджелудочной железы",
                            "почек",
                            "селезенки"
                        ]
                    ],
                    [
                        "name" => "УЗИ малого таза",
                        "services" => [
                            "мочевого пузыря",
                            "мочевого пузыря с определением остаточной мочи",
                            "обзорное (трансабдоминально)",
                            "обзорное (трансвагинально/трансректально)"
                        ]
                    ],
                    [
                        "name" => "УЗИ суставов и тканей",
                        "services" => [
                            "коленного сустава",
                            "лимфатических узлов",
                            "мелкого сустава",
                            "мягких тканей",
                            "тазобедренного сустава"
                        ]
                    ],
                    [
                        "name" => "Дуплексное сканирование",
                        "services" => [
                            "аорты и нижней полой вены",
                            "артерий верхних конечностей",
                            "артерий нижних конечностей",
                            "брахиоцефальных артерий",
                            "вен верхних конечностей",
                            "вен нижних конечностей",
                            "дуги аорты и ее ветвей",
                            "магистральных сосудов головы",
                            "маточно-плацентарного кровотока",
                            "почечных артерий",
                            "УЗИ сердца (ЭХОКГ)",
                            "сосудов печени"
                        ]
                    ],
                    [
                        "name" => "УЗИ брюшной полости",
                        "services" => [
                            "передней брюшной стенки на наличие грыжи (пупочной, паховой)"
                        ]
                    ],
                    [
                        "name" => "УЗИ",
                        "services" => [
                            "УЗИ плевральных полостей"
                        ]
                    ],
                    [
                        "name" => "УЗИ брюшной полости",
                        "services" => [
                            "желудка с водно-сифонной пробой"
                        ]
                    ]
                ]
            ]
        ];

        foreach ($service_data as $service_types) {
            foreach ($service_types['services_categories'] as $service_categories) {
                $service_category = ServiceCategory::firstOrCreate([
                    'name' => $service_categories['name'],
                    'service_type_id' => $service_types['service_type_id']
                ]);

                Service::insert(
                    array_map(
                        fn($item) => ['name' => $item, 'service_category_id' => $service_category->id],
                        $service_categories['services']
                    )
                );
            }
        }
    }
}
